; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v7 ?v12)
             (pred_12 ?v9 ?v5)
             (pred_4 ?v7 ?v5)
             (pred_6 ?v11 ?v7 )
	     (pred_10 ?v7)
             (pred_8 ?v13)
             (pred_7 ?v9)
             (pred_3 ?v5)
             (pred_9 ?v7)
             (pred_2 ?v9)
             (pred_11 ?v7)
             (pred_1 ))



(:action op_5
:parameters (?v2 ?v6 ?v1 ?v4)
:precondition (and (pred_8 ?v2) (pred_8 ?v6) (pred_7 ?v1) (pred_3 ?v4)
          (pred_5 ?v2 ?v6) (pred_12 ?v1 ?v4)
                   (pred_4 ?v6 ?v4) (pred_10 ?v2) 
                   (pred_9 ?v6) (pred_2 ?v1))
:effect (and  (pred_11 ?v6) (not (pred_9 ?v6))))


(:action op_4
:parameters (?v2 ?v3)
:precondition (and (pred_8 ?v2) (pred_8 ?v3)
               (pred_10 ?v2) (pred_5 ?v2 ?v3) (pred_11 ?v3))
:effect (and (pred_10 ?v3) (not (pred_10 ?v2))))

(:action op_3
:parameters (?v2 ?v1)
:precondition (and (pred_8 ?v2) (pred_7 ?v1) 
                  (pred_10 ?v2) (pred_6 ?v1 ?v2) (pred_1 ))
:effect (and (pred_2 ?v1)
   (not (pred_6 ?v1 ?v2)) (not (pred_1 ))))


(:action op_1
:parameters (?v2 ?v8 ?v10)
:precondition (and (pred_8 ?v2) (pred_7 ?v8) (pred_7 ?v10)
                  (pred_10 ?v2) (pred_2 ?v10) (pred_6 ?v8 ?v2))
:effect (and (pred_2 ?v8) (pred_6 ?v10 ?v2)
        (not (pred_2 ?v10)) (not (pred_6 ?v8 ?v2))))

(:action op_2
:parameters (?v2 ?v1)
:precondition (and (pred_8 ?v2) (pred_7 ?v1) 
                  (pred_10 ?v2) (pred_2 ?v1))
:effect (and (pred_1 ) (pred_6 ?v1 ?v2) (not (pred_2 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_20 obj_09 obj_01 obj_27 obj_14 obj_13 obj_07 obj_22 obj_12 obj_06 obj_23 obj_18 obj_30 obj_25 obj_24 obj_08 obj_03 obj_02 obj_16 obj_21 obj_26 obj_15 obj_10 obj_17 obj_19
    obj_28 obj_29
    obj_04 obj_11 obj_05
    )

    (:init
       (pred_1)

       (pred_8 obj_20)
       (pred_8 obj_09)
       (pred_8 obj_01)
       (pred_8 obj_27)
       (pred_8 obj_14)
       (pred_8 obj_13)
       (pred_8 obj_07)
       (pred_8 obj_22)
       (pred_8 obj_12)
       (pred_8 obj_06)
       (pred_8 obj_23)
       (pred_8 obj_18)
       (pred_8 obj_30)
       (pred_8 obj_25)
       (pred_8 obj_24)
       (pred_8 obj_08)
       (pred_8 obj_03)
       (pred_8 obj_02)
       (pred_8 obj_16)
       (pred_8 obj_21)
       (pred_8 obj_26)
       (pred_8 obj_15)
       (pred_8 obj_10)
       (pred_8 obj_17)
       (pred_8 obj_19)
       (pred_3 obj_28)
       (pred_3 obj_29)
       (pred_7 obj_04)
       (pred_7 obj_11)
       (pred_7 obj_05)

       (pred_5 obj_20 obj_13)
       (pred_5 obj_20 obj_09)
       (pred_5 obj_09 obj_07)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_01 obj_22)
       (pred_5 obj_01 obj_27)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_27 obj_12)
       (pred_5 obj_27 obj_14)
       (pred_5 obj_27 obj_01)
       (pred_5 obj_14 obj_06)
       (pred_5 obj_14 obj_27)
       (pred_5 obj_13 obj_23)
       (pred_5 obj_13 obj_07)
       (pred_5 obj_13 obj_20)
       (pred_5 obj_07 obj_18)
       (pred_5 obj_07 obj_22)
       (pred_5 obj_07 obj_09)
       (pred_5 obj_07 obj_13)
       (pred_5 obj_22 obj_30)
       (pred_5 obj_22 obj_12)
       (pred_5 obj_22 obj_01)
       (pred_5 obj_22 obj_07)
       (pred_5 obj_12 obj_25)
       (pred_5 obj_12 obj_06)
       (pred_5 obj_12 obj_27)
       (pred_5 obj_12 obj_22)
       (pred_5 obj_06 obj_24)
       (pred_5 obj_06 obj_14)
       (pred_5 obj_06 obj_12)
       (pred_5 obj_23 obj_08)
       (pred_5 obj_23 obj_18)
       (pred_5 obj_23 obj_13)
       (pred_5 obj_18 obj_03)
       (pred_5 obj_18 obj_30)
       (pred_5 obj_18 obj_07)
       (pred_5 obj_18 obj_23)
       (pred_5 obj_30 obj_02)
       (pred_5 obj_30 obj_25)
       (pred_5 obj_30 obj_22)
       (pred_5 obj_30 obj_18)
       (pred_5 obj_25 obj_16)
       (pred_5 obj_25 obj_24)
       (pred_5 obj_25 obj_12)
       (pred_5 obj_25 obj_30)
       (pred_5 obj_24 obj_21)
       (pred_5 obj_24 obj_06)
       (pred_5 obj_24 obj_25)
       (pred_5 obj_08 obj_26)
       (pred_5 obj_08 obj_03)
       (pred_5 obj_08 obj_23)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_03 obj_18)
       (pred_5 obj_03 obj_08)
       (pred_5 obj_02 obj_10)
       (pred_5 obj_02 obj_16)
       (pred_5 obj_02 obj_30)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_16 obj_17)
       (pred_5 obj_16 obj_21)
       (pred_5 obj_16 obj_25)
       (pred_5 obj_16 obj_02)
       (pred_5 obj_21 obj_19)
       (pred_5 obj_21 obj_24)
       (pred_5 obj_21 obj_16)
       (pred_5 obj_26 obj_15)
       (pred_5 obj_26 obj_08)
       (pred_5 obj_15 obj_10)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_15 obj_26)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_02)
       (pred_5 obj_10 obj_15)
       (pred_5 obj_17 obj_19)
       (pred_5 obj_17 obj_16)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_19 obj_21)
       (pred_5 obj_19 obj_17)
       (pred_9 obj_19)
       (pred_9 obj_27)
       (pred_9 obj_02)
       (pred_4  obj_19 obj_28)
       (pred_4  obj_27 obj_29)
       (pred_4  obj_02 obj_28)
       (pred_11 obj_20)
       (pred_11 obj_09)
       (pred_11 obj_01)
       (pred_11 obj_14)
       (pred_11 obj_13)
       (pred_11 obj_07)
       (pred_11 obj_22)
       (pred_11 obj_12)
       (pred_11 obj_06)
       (pred_11 obj_23)
       (pred_11 obj_18)
       (pred_11 obj_30)
       (pred_11 obj_25)
       (pred_11 obj_24)
       (pred_11 obj_08)
       (pred_11 obj_03)
       (pred_11 obj_16)
       (pred_11 obj_21)
       (pred_11 obj_26)
       (pred_11 obj_15)
       (pred_11 obj_10)
       (pred_11 obj_17)

       (pred_12  obj_04 obj_28)
       (pred_12  obj_11 obj_29)
       (pred_12  obj_05 obj_29)
       (pred_6 obj_04 obj_09)
       (pred_6 obj_11 obj_23)
       (pred_6 obj_05 obj_12)
       (pred_10 obj_09)
    )

    (:goal (and
       (pred_6 obj_04 obj_13)
       (pred_6 obj_05 obj_27)
    ))
(:constraints
  (always (not (pred_10 obj_01)))
)
)

; plan
1. (op_3 obj_09 obj_04)
   deleted: (pred_6 obj_04 obj_09) (pred_1)
   added: (pred_2 obj_04)
   goals met: 0 of 2
2. (op_4 obj_09 obj_20)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_20)
   goals met: 0 of 2
3. (op_4 obj_20 obj_13)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_13)
   goals met: 0 of 2
4. (op_2 obj_13 obj_04)
   deleted: (pred_2 obj_04)
   added: (pred_1) (pred_6 obj_04 obj_13)
   goals met: 1 of 2
5. (op_4 obj_13 obj_07)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_07)
   goals met: 1 of 2
6. (op_4 obj_07 obj_22)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_22)
   goals met: 1 of 2
7. (op_4 obj_22 obj_12)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_12)
   goals met: 1 of 2
8. (op_3 obj_12 obj_05)
   deleted: (pred_6 obj_05 obj_12) (pred_1)
   added: (pred_2 obj_05)
   goals met: 1 of 2
9. (op_5 obj_12 obj_27 obj_05 obj_29)
   deleted: (pred_9 obj_27)
   added: (pred_11 obj_27)
   goals met: 1 of 2
10. (op_4 obj_12 obj_27)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_27)
   goals met: 1 of 2
11. (op_2 obj_27 obj_05)
   deleted: (pred_2 obj_05)
   added: (pred_1) (pred_6 obj_05 obj_27)
   goals met: 2 of 2
